{
    "intents" : [
        {
            "tag": "greeting",
            "patterns": ["Hi", "Hello", "Hey", "How are you", "What's up"],
            "responses": ["Hi there", "Hello", "Hey", "I'm fine, thank you", "Nothing much"]
        },
        {
            "tag": "goodbye",
            "patterns": ["Bye", "See you later", "Goodbye", "Take care"],
            "responses": ["Goodbye", "See you later", "Take care"]
        },
        {
            "tag": "thanks",
            "patterns": ["Thank you", "Thanks", "Thanks a lot", "I appreciate it"],
            "responses": ["You're welcome", "No problem", "Glad I could help"]
        },
        {
            "tag": "about",
            "patterns": ["What can you do", "Who are you", "What are you", "What is your purpose"],
            "responses": ["I am a chatbot", "My purpose is to assist you", "I can answer questions and provide assistance"]
        },
        {
            "tag": "help",
            "patterns": ["Help", "I need help", "Can you help me", "What should I do"],
            "responses": ["Sure, what do you need help with?", "I'm here to help. What's the problem?", "How can I assist you?"]
        },
        {
            "tag": "age",
            "patterns": ["How old are you", "What's your age"],
            "responses": ["I don't have an age. I'm a chatbot.", "I was just born in the digital world.", "Age is just a number for me."]
        },
        {
            "tag": "weather",
            "patterns": ["What's the weather like", "How's the weather today"],
            "responses": ["I'm sorry, I cannot provide real-time weather information.", "You can check the weather on a weather app or website."]
        },
        {
            "tag": "budget",
            "patterns": ["How can I make a budget", "What's a good budgeting strategy", "How do I create a budget"],
            "responses": ["To make a budget, start by tracking your income and expenses. Then, allocate your income towards essential expenses like rent, food, and bills. Next, allocate some of your income towards savings and debt repayment. Finally, allocate the remainder of your income towards discretionary expenses like entertainment and hobbies.", "A good budgeting strategy is to use the 50/30/20 rule. This means allocating 50% of your income towards essential expenses, 30% towards discretionary expenses, and 20% towards savings and debt repayment.", "To create a budget, start by setting financial goals for yourself. Then, track your income and expenses for a few months to get a sense of where your money is going. Next, create a budget by allocating your income towards essential expenses, savings and debt repayment, and discretionary expenses."]
        },
        {
            "tag": "credit_score",
            "patterns": ["What is a credit score", "How do I check my credit score", "How can I improve my credit score"],
            "responses": ["A credit score is a number that represents your creditworthiness. It is based on your credit history and is used by lenders to determine whether or not to lend you money. The higher your credit score, the more likely you are to be approved for credit.", "You can check your credit score for free on several websites such as Credit Karma and Credit Sesame."]
        },
        { 
            "tag": "battery types",
            "patterns": [
              "What are the different types of batteries?",
              "Can you list the types of batteries?",
              "What types of batteries are commonly used?",
              "What are the main types of batteries?",
              "How many types of batteries are there?"
            ],
            "responses": [
              "The main types of batteries include alkaline, lithium-ion, nickel-cadmium (NiCd), nickel-metal hydride (NiMH), and lead-acid batteries.",
              "Common battery types are alkaline, lithium-ion, lithium polymer, nickel-cadmium, and lead-acid."
            ]
        },
        { 
            "tag": "alkaline battery",
          "patterns": [
            "What is an alkaline battery?",
            "How does an alkaline battery work?",
            "What are the uses of alkaline batteries?",
            "Are alkaline batteries rechargeable?",
            "What devices use alkaline batteries?"
          ],
          "responses": [
            "An alkaline battery is a type of primary battery that uses an alkaline electrolyte, typically potassium hydroxide.",
            "Alkaline batteries are commonly used in household devices like remote controls, flashlights, and toys."
          ]
        },
        {
            "tag": "lithium ion battery",
          "patterns": [
            "What is a lithium-ion battery?",
            "How does a lithium-ion battery work?",
            "What are the advantages of lithium-ion batteries?",
            "Where are lithium-ion batteries used?",
            "Are lithium-ion batteries safe?"
          ],
          "responses": [
            "A lithium-ion battery is a rechargeable battery that uses lithium ions as the primary component of its electrochemistry.",
            "Lithium-ion batteries are widely used in smartphones, laptops, electric vehicles, and renewable energy storage."
          ]
        },
        {
            "tag": "lead acid battery",
            "patterns": [
              "What is a lead-acid battery?",
              "How does a lead-acid battery work?",
              "What are the applications of lead-acid batteries?",
              "Are lead-acid batteries rechargeable?",
              "What are the pros and cons of lead-acid batteries?"
            ],
            "responses": [
              "A lead-acid battery is a type of rechargeable battery that uses lead dioxide and sponge lead as electrodes.",
              "Lead-acid batteries are commonly used in vehicles, uninterruptible power supplies (UPS), and backup power systems."
            ]
        },
        { 
            "tag": "nickel cadmium battery",
          "patterns": [
            "What is a nickel-cadmium battery?",
            "How does a nickel-cadmium battery work?",
            "What are the uses of nickel-cadmium batteries?",
            "Are nickel-cadmium batteries still used?",
            "What are the advantages of nickel-cadmium batteries?"
          ],
          "responses": [
            "A nickel-cadmium (NiCd) battery is a type of rechargeable battery that uses nickel oxide hydroxide and metallic cadmium as electrodes.",
            "NiCd batteries are used in power tools, emergency lighting, and some consumer electronics."
          ]
        },
        { 
            "tag": "nickel metal hydride battery",
          "patterns": [
            "What is a nickel-metal hydride battery?",
            "How does a nickel-metal hydride battery work?",
            "What are the applications of nickel-metal hydride batteries?",
            "Are nickel-metal hydride batteries better than nickel-cadmium?",
            "What devices use nickel-metal hydride batteries?"
          ],
          "responses": [
            "A nickel-metal hydride (NiMH) battery is a type of rechargeable battery that uses nickel oxide hydroxide and a hydrogen-absorbing alloy.",
            "NiMH batteries are commonly used in hybrid vehicles, digital cameras, and portable electronics."
          ]
        },
        {
            "tag": "battery life",
          "patterns": [
            "What affects battery life?",
            "How can I extend the life of my battery?",
            "What is the average lifespan of a lithium-ion battery?",
            "Why do batteries lose their charge over time?",
            "How can I improve battery performance?"
          ],
          "responses": [
            "Battery life can be affected by factors such as temperature, charge cycles, and usage patterns.",
            "To extend battery life, avoid extreme temperatures, do not fully discharge the battery, and use the correct charger."
          ]
        },
        { 
            "tag": "engine function",
          "patterns": [
            "What is the function of a car engine?",
            "How does a car engine work?",
            "Can you explain the purpose of an engine?",
            "What does a car engine do?",
            "Why do we need an engine in a car?"
          ],
          "responses": [
            "The car engine converts fuel into mechanical energy to power the vehicle.",
            "A car engine is responsible for converting fuel into motion.",
            "The primary function of an engine is to provide power to move the vehicle."
          ]
        },
        {
            
          "tag": "internal combustion",
          "patterns": [
            "How does an internal combustion engine work?",
            "What is an internal combustion engine?",
            "Can you explain internal combustion?",
            "How does fuel ignite in an engine?",
            "What happens in an internal combustion engine?"
          ],
          "responses": [
            "An internal combustion engine works by igniting a mixture of fuel and air in a cylinder, causing a small explosion that pushes a piston.",
            "In an internal combustion engine, fuel is mixed with air and ignited, creating pressure that moves the pistons."
          ]
        },
        {
            "tag": "engine components",
          "patterns": [
            "What are the main components of a car engine?",
            "Can you list the parts of an engine?",
            "What makes up a car engine?",
            "What are the key components of an internal combustion engine?",
            "What parts are essential in a car engine?"
          ],
          "responses": [
            "The main components include the cylinder block, pistons, crankshaft, camshaft, and valves.",
            "Key parts of a car engine are the cylinder head, pistons, crankshaft, and timing belt."
          ]
        },
        {
            "tag": "crankshaft",
            "patterns": [
              "What is the role of the crankshaft?",
              "How does the crankshaft work?",
              "What does the crankshaft do in an engine?",
              "Can you explain the function of a crankshaft?",
              "Why is the crankshaft important?"
            ],
            "responses": [
              "The crankshaft converts the linear motion of the pistons into rotational motion to turn the wheels.",
              "The crankshaft is crucial as it transforms the up-and-down motion of the pistons into rotational energy."
            ]
        },
        {
            "tag": "spark plug",
          "patterns": [
            "What is a spark plug?",
            "How does a spark plug work?",
            "What does a spark plug do?",
            "Why are spark plugs important?",
            "Can you explain the function of a spark plug?"
          ],
          "responses": [
            "A spark plug ignites the air-fuel mixture in the combustion chamber of a gasoline engine.",
            "Spark plugs create a spark that ignites the fuel-air mixture, allowing the engine to run."
          ]
        },
        {
            "tag": "diese vs gasoline",
          "patterns": [
            "What is the difference between a diesel engine and a gasoline engine?",
            "How do diesel engines differ from gasoline engines?",
            "Can you explain diesel vs gasoline engines?",
            "What are the key differences between diesel and gasoline engines?",
            "Why choose a diesel engine over a gasoline engine?"
          ],
          "responses": [
            "Diesel engines use compression ignition, while gasoline engines use spark ignition.",
            "The main difference is that diesel engines compress air to ignite fuel, whereas gasoline engines rely on a spark."
          ]
        },
        {
            
          "tag": "cooling system",
          "patterns": [
            "How does the cooling system work in a car engine?",
            "What is the purpose of the cooling system?",
            "Can you explain how engine cooling works?",
            "Why is cooling important for an engine?",
            "What does the cooling system do?"
          ],
          "responses": [
            "The cooling system circulates coolant through the engine to absorb heat and maintain optimal operating temperature.",
            "It prevents the engine from overheating by transferring heat away from the engine components."
          ]
    
        },
        {
            "tag": "engine oil",
            "patterns": [
              "What is engine oil used for?",
              "Why do we need engine oil?",
              "How often should I change my engine oil?",
              "What does engine oil do?",
              "Can you explain the importance of engine oil?"
            ],
            "responses": [
              "Engine oil lubricates moving parts, reduces friction, and helps to cool the engine.",
              "It is essential for reducing wear and tear on engine"]
    
    
        }
        
    ]
    }
